Cas_de_base/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    side
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    airfoil
    {
        type            calculated;
        value           nonuniform List<vector> 
157
(
(-1.59702 -0.267885 -2.71839e-21)
(-1.52837 -0.318291 3.01131e-21)
(-1.49842 -0.368144 -2.205e-21)
(-1.49957 -0.416052 9.92676e-21)
(-1.52672 -0.461177 0)
(-1.57909 -0.504299 6.54214e-20)
(-1.6583 -0.544539 0)
(-1.76688 -0.580524 -6.11077e-20)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
