Cas_de_base/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          incompressibleFluid;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         500;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{

    #includeFunc residuals

    forces
    {
        type            forceCoeffs;
        libs            ("libforces.so");
        writeControl    writeTime;

        patches
        (
            airfoil
        );

        rho         rhoInf;
        rhoInf      1.225;

        CofR        (0 0 0);
        liftDir     (-0.17364817766693033 0.984807753012208 0);
        dragDir     (0.984807753012208 0.17364817766693033 0);
        pitchAxis   (0 0 1);
        magUInf     90;
        lRef        1;
        Aref        1;
    }

	
    
}

// ************************************************************************* //
